/** 文件信息 */

	/** 文件Id   */ private Long    fileId ;
	/** 文件编码 */ private String  code   ;
	/** 文件大小 */ private Integer size   ;
	/** 文件时长 */ private Integer timeLen;
	/** 文件分类 */ private Byte    type   ; //1文本 2文档 3图片 4视频 5音乐 10其它
	/** 引用次数 */ private Integer use    ;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/fileInf!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * fileId       可选   文件Id
	 * code         可选   文件编码
	 * size         可选   文件大小
	 * timeLen      可选   文件时长
	 * type         可选   文件分类 1文本 2文档 3图片 4视频 5音乐 10其它
	 * use          可选   引用次数
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[FileInf]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/fileInf!newRec.action
	 *
	 * 参数
	 * code     必需   文件编码
	 * size     可选   文件大小
	 * timeLen  可选   文件时长
	 * type     可选   文件分类 1文本 2文档 3图片 4视频 5音乐 10其它
	 * use      可选   引用次数
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{FileInf}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/fileInf!edit.action
	 *
	 * 参数
	 * fileId   必需   文件Id
	 * code     可选   文件编码
	 * size     可选   文件大小
	 * timeLen  可选   文件时长
	 * type     可选   文件分类 1文本 2文档 3图片 4视频 5音乐 10其它
	 * use      可选   引用次数
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除
	 * 权限：
	 *
	 * URL：p/fileInf!del.action
	 *
	 * 参数
	 * fileIds   必需   文件Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
