/** 系统任务 */

	/** 任务Id   */ private Long      tasId  ;
	/** 任务类型 */ private Byte      type   ;
	/** 目标Id   */ private Long      tagId  ;
	/** 来源路径 */ private String    srcPath;
	/** 目标路径 */ private String    tagPath;
	/** 附加信息 */ private String    append ;
	/** 执行时间 */ private Timestamp time   ;
	/** 任务状态 */ private Byte      state  ; //1等待中 2执行中 3执行失败
	/** 备注信息 */ private String    msg    ;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/task!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * tasId        可选   任务Id
	 * type         可选   任务类型
	 * tagId        可选   目标Id
	 * srcPath      可选   来源路径
	 * tagPath      可选   目标路径
	 * append       可选   附加信息
	 * state        可选   任务状态 1等待中 2执行中 3执行失败
	 * msg          可选   备注信息
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[Task]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/task!newRec.action
	 *
	 * 参数
	 * type     必需   任务类型
	 * tagId    可选   目标Id
	 * srcPath  可选   来源路径
	 * tagPath  可选   目标路径
	 * append   可选   附加信息
	 * time     可选   执行时间
	 * state    可选   任务状态 1等待中 2执行中 3执行失败
	 * msg      可选   备注信息
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{Task}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/task!edit.action
	 *
	 * 参数
	 * tasId    必需   任务Id
	 * type     可选   任务类型
	 * tagId    可选   目标Id
	 * srcPath  可选   来源路径
	 * tagPath  可选   目标路径
	 * append   可选   附加信息
	 * time     可选   执行时间
	 * state    可选   任务状态 1等待中 2执行中 3执行失败
	 * msg      可选   备注信息
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/task!chState.action
	 *
	 * 参数
	 * tasIds   必需   任务Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除
	 * 权限：
	 *
	 * URL：p/task!del.action
	 *
	 * 参数
	 * tasIds   必需   任务Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 立即执行任务
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：立即执行任务 -- 不管任务是何状态，都会执行
	 * 权限：
	 *
	 * URL：p/task!immExe.action
	 *
	 * 参数
	 * tasIds   必需   任务Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
