/** 配置信息 */

	/** 自动审核--资源               */ private Integer auto_AuResource        ; //0=false、1=true
	/** 自动审核--教师空间           */ private Integer auto_AuTeacher         ; //0=false、1=true
	/** 自动审核--学生空间           */ private Integer auto_AuStudent         ; //0=false、1=true
	/** 自动审核--课程               */ private Integer auto_AuCourse          ; //0=false、1=true
	/** 自动收集--学生错题(自动批改) */ private Integer auto_GetStuErI_AutoMark; //0=false、1=true
	/** 自动收集--学生错题(手动批改) */ private Integer auto_GetStuErI_Mark    ; //0=false、1=true

	//==================================================================================================================
	// 查询配置信息
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：查询配置信息
     * 权限：无限制
     *
     * URL：p/conf!query.action
     *
     * 参数：
     *
     * 出错返回：{"s":false,"m":"错误信息"}
     * 正确返回：{"s":true,"d":{ConfInf}}
     *
     */

	//==================================================================================================================
	// 修改配置信息
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：修改配置信息
     * 权限：管理
     *
     * URL：p/conf!edit.action
     *
     * 参数：
     * auto_AuResource          可选   自动审核--资源               0=false、1=true
     * auto_AuTeacher           可选   自动审核--教师空间           0=false、1=true
     * auto_AuStudent           可选   自动审核--学生空间           0=false、1=true
     * auto_AuCourse            可选   自动审核--课程               0=false、1=true
     * auto_GetStuErI_AutoMark  可选   自动收集--学生错题(自动批改) 0=false、1=true
     * auto_GetStuErI_Mark      可选   自动收集--学生错题(手动批改) 0=false、1=true
     *
     * 出错返回：{"s":false,"m":"错误信息"}
     * 正确返回：{"s":true,"m":"成功信息"}
     *
     */

	//==================================================================================================================
	// 获取时间戳
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：获取时间戳
     * 权限：无限制
     *
     * URL：p/conf!getTs.action
     *
     * 返回：{"s":true,"ts":时间戳}
     *
     */

	//==================================================================================================================
	// 测试服务器是否正常
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：测试服务器是否正常
     * 权限：无限制
     *
     * URL：p/conf!test.action
     *
     * 返回：{"s":true/false,"m":"文字信息"}
     *
     */

	//==================================================================================================================
	//------------------------------------------------------------------------------------------------------------------

    //==================================================================================================================
}
