/** 会员积分 */

	/** 积分流水Id */ private Long    runId  ;
	/** 会员Id     */ private Long    memId  ;
	/** 发生时间   */ private Integer time   ; //秒戳
	/** 操作类型   */ private Byte    type   ; //1初始 2存取
	/** 积分摘要   */ private String  summary;
	/** 取得分值   */ private Double  point  ;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：管理、个人
	 *
	 * URL：p/memPot!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * runId        可选   积分流水Id
	 * memId        可选   会员Id -- 管理
	 * time         可选   发生时间(秒戳)
	 * type         可选   操作类型 1初始 2存取
	 * summary      可选   积分摘要
	 * point        可选   取得分值
	 * timeMin      可选   发生时间：最小值
	 * timeMax      可选   发生时间：最大值
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[MemPoint]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/memPot!newRec.action
	 *
	 * 参数
	 * memId    必需   会员Id
	 * type     可选   操作类型 1初始 2存取
	 * summary  必需   积分摘要
	 * point    必需   取得分值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{MemPoint}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/memPot!edit.action
	 *
	 * 参数
	 * runId    必需   积分流水Id
	 * summary  可选   积分摘要
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
