/** 会员消息 */

	/** 会员消息Id */ private Long      msgId   ;
	/** 接收者Id   */ private Long      recMemId;
	/** 接收者     */ private String    receiver;
	/** 发送者Id   */ private Long      senMemId; //0代表系统信息
	/** 发送者     */ private String    sender  ;
	/** 发送时间   */ private Timestamp time    ;
	/** 消息类型   */ private Byte      type    ; //1普通 2私信 3公告 10课程 11课堂
	/** 相关Id     */ private Long      relId   ;
	/** 信息标题   */ private String    title   ;
	/** 信息内容   */ private String    msg     ;
	/** 查阅标记   */ private Byte      see     ; //1未查阅 2已查阅

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/memMsg!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * msgId        可选   会员消息Id
	 * recMemId     可选   接收者Id
	 * receiver     可选   接收者
	 * senMemId     可选   发送者Id 0代表系统信息
	 * sender       可选   发送者
	 * type         可选   消息类型 1普通 2私信 3公告 10课程 11课堂
	 * relId        可选   相关Id
	 * title        可选   信息标题
	 * msg          可选   信息内容
	 * see          可选   查阅标记 1未查阅 2已查阅
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[MemberMsg]}
	 *
	 */

	//==================================================================================================================
	// 我的新(未读)消息数量
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：我的新(未读)消息数量
	 * 权限：个人
	 *
	 * URL：p/memMsg!newMsgNum.action
	 *
	 * 参数：无
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"n":"未读消息总数"}
	 *
	 */

	//==================================================================================================================
	// 我的消息列表
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：我的消息列表
	 * 权限：个人
	 *
	 * URL：p/memMsg!myMsg.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * msgId        可选   会员消息Id
	 * senMemId     可选   发送者Id 0代表系统信息
	 * sender       可选   发送者
	 * type         可选   消息类型 1普通 2私信 3公告 10课程 11课堂
	 * relId        可选   相关Id
	 * title        可选   信息标题
	 * see          可选   查阅标记 1未查阅 2已查阅
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[MemberMsg]}
	 *
	 */

	//==================================================================================================================
	// 查阅消息
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查阅消息
	 * 权限：个人
	 *
	 * URL：p/memMsg!showMsg.action
	 *
	 * 参数
	 * msgId   可选   会员消息Id
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,,"d":{MemberMsg}}
	 *
	 */

	//==================================================================================================================
	// 新增、发送消息
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增、发送消息
	 * 权限：管理、个人
	 *
	 * URL：p/memMsg!newRec.action
	 *
	 * 参数
	 * recMemId  必需   接收者Id
	 * senMemId  可选   发送者Id -- 管理
	 * type      可选   消息类型 -- 管理 1普通 2私信(个人) 3公告 10课程 11课堂
	 * relId     可选   相关Id
	 * title     可选   信息标题
	 * msg       可选   信息内容
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/memMsg!edit.action
	 *
	 * 参数
	 * msgId     必需   会员消息Id
	 * type      可选   消息类型 1普通 2私信 3公告 10课程 11课堂
	 * relId     可选   相关Id
	 * title     可选   信息标题
	 * msg       可选   信息内容
	 * see       可选   查阅标记 1未查阅 2已查阅
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除
	 * 权限：管理、个人(自己收到的消息)
	 *
	 * URL：p/memMsg!del.action
	 *
	 * 参数
	 * msgIds   必需   会员消息Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 标为已阅
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：标为已阅
	 * 权限：管理、个人(自己收到的消息)
	 *
	 * URL：p/memMsg!markSee.action
	 *
	 * 参数
	 * msgIds   必需   会员消息Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
