/*******************************************************************************************************
 * 课程相关
 *******************************************************************************************************/

 //获取课程列表
 export const GET_COURSE_LIST = "GET_COURSE_LIST";

 //设置当前课程对象
 export const SET_CURRENT_COURSE = "SET_CURRENT_COURSE" 

 
/*******************************************************************************************************
 * 课堂相关
 *******************************************************************************************************/

 //获取课程中某个章节目录下的所有课堂列表
 export const GET_CLASS_LIST = "GET_CLASS_LIST";

 //设置当课堂程对象
 export const SET_CURRENT_CLASS = "SET_CURRENT_CLASS" 

