/** 入学年级 */

	/** 校区Id   */ private Integer schId    ; //0代表通用
	/** 入学年级 */ private Integer year     ;
	/** 年级名称 */ private String  yeaNm    ;
	/** 班级总数 */ private Short   claCount ;
	/** 男生人数 */ private Integer boyCount ;
	/** 女生人数 */ private Integer girlCount;
	/** 备注信息 */ private String  remark   ;
	/** 记录状态 */ private Byte    state    ; //2正常 3关闭 4历史

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/jye!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * schId        可选   校区Id
	 * year         可选   入学年级
	 * yeaNm        可选   年级名称
	 * claCount     可选   班级总数
	 * boyCount     可选   男生人数
	 * girlCount    可选   女生人数
	 * remark       可选   备注信息
	 * state        可选   记录状态 2正常 3关闭 4历史
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[JoinYear]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/jye!newRec.action
	 *
	 * 参数
	 * schId    必需   校区Id
	 * year     必需   入学年级
	 * yeaNm    可选   年级名称
	 * remark   可选   备注信息
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{JoinYear}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/jye!edit.action
	 *
	 * 参数
	 * schId    必需   校区Id
	 * year     必需   入学年级
	 * yeaNm    可选   年级名称
	 * remark   可选   备注信息
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/jye!chState.action
	 *
	 * 参数
	 * schId    必需   校区Id
	 * year     必需   入学年级
	 * state    必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4历史”的记录
	 * 权限：
	 *
	 * URL：p/jye!del.action
	 *
	 * 参数
	 * schIds   必需   校区Id 多个用“,”隔开
	 * years    必需   入学年级 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
