/** 学期信息 */

	/** 学期Id       */ private Integer termId   ;
	/** 学期名称     */ private String  name     ;
	/** 开学日期     */ private Date    startDate;
	/** 结束日期     */ private Date    endDate  ;
	/** 首个周一日期 */ private Date    firstMon ;
	/** 周数         */ private Byte    weeks    ;
	/** 当前学期     */ private Byte    cur      ; //1是 2否
	/** 学期状态     */ private Byte    state    ; //2正常 3关闭 4历史
	/** 备注         */ private String  remark   ;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/term!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * termId       可选   学期Id
	 * name         可选   学期名称
	 * weeks        可选   周数
	 * cur          可选   当前学期 1是 2否
	 * state        可选   学期状态 2正常 3关闭 4历史
	 * remark       可选   备注
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[Term]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/term!newRec.action
	 *
	 * 参数
	 * name       必需   学期名称
	 * startDate  可选   开学日期
	 * endDate    可选   结束日期
	 * firstMon   可选   首个周一日期
	 * weeks      可选   周数
	 * cur        可选   当前学期 1是 2否
	 * remark     可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{Term}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/term!edit.action
	 *
	 * 参数
	 * termId     必需   学期Id
	 * name       可选   学期名称
	 * startDate  可选   开学日期
	 * endDate    可选   结束日期
	 * firstMon   可选   首个周一日期
	 * weeks      可选   周数
	 * cur        可选   当前学期 1是 2否
	 * remark     可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/term!chState.action
	 *
	 * 参数
	 * termIds   必需   学期Id 多个用“,”隔开
	 * state     必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4历史”的记录
	 * 权限：
	 *
	 * URL：p/term!del.action
	 *
	 * 参数
	 * termIds   必需   学期Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
