/** 小组信息 */

	/** 小组Id   */ private Integer teamId ;
	/** 班级Id   */ private Integer claId  ;
	/** 小组名称 */ private String  name   ;
	/** 小组说明 */ private String  explain;
	/** 小组长   */ private String  leader ;
	/** 小组状态 */ private Byte    state  ; //2正常 3锁定 4关闭

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/team!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * teamId       可选   小组Id
	 * claId        可选   班级Id
	 * name         可选   小组名称
	 * explain      可选   小组说明
	 * leader       可选   小组长
	 * state        可选   小组状态 2正常 3锁定 4关闭
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[Team]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/team!newRec.action
	 *
	 * 参数
	 * claId    必需   班级Id
	 * name     可选   小组名称
	 * explain  可选   小组说明
	 * leader   可选   小组长
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{Team}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/team!edit.action
	 *
	 * 参数
	 * teamId   必需   小组Id
	 * name     可选   小组名称
	 * explain  可选   小组说明
	 * leader   可选   小组长
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/team!chState.action
	 *
	 * 参数
	 * teamIds   必需   小组Id 多个用“,”隔开
	 * state     必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“1、2”的记录
	 * 权限：
	 *
	 * URL：p/team!del.action
	 *
	 * 参数
	 * teamIds   必需   小组Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
