/** 教学场地 */

	/** 场地Id   */ private Integer romId  ;
	/** 场地校区 */ private Integer schId  ;
	/** 场地部门 */ private Integer depId  ;
	/** 场地编号 */ private String  nO     ;
	/** 场地名称 */ private String  name   ;
	/** 场地类型 */ private Integer type   ; //代码13 1普通教室
	/** 场地地址 */ private String  address;
	/** 座位数量 */ private Short   seatNum;
	/** 并班系数 */ private Byte    merge  ;
	/** 场地状态 */ private Byte    state  ; //2正常 3关闭 4历史
	/** 备注     */ private String  remark ;
	/** 校区名称 */ private String  schNm  ;
	/** 部门名称 */ private String  depNm  ;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/rom!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * romId        可选   场地Id
	 * schId        可选   场地校区
	 * depId        可选   场地部门
	 * nO           可选   场地编号
	 * name         可选   场地名称
	 * type         可选   场地类型 1普通教室
	 * address      可选   场地地址
	 * seatNum      可选   座位数量
	 * merge        可选   并班系数
	 * state        可选   场地状态 2正常 3关闭 4历史
	 * remark       可选   备注
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[ClassRoom]}
	 *
	 */

	//==================================================================================================================
	// 详细查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：详细查询
	 * 权限：
	 *
	 * URL：p/rom!query2.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * romId        可选   场地Id
	 * schId        可选   场地校区
	 * depId        可选   场地部门
	 * nO           可选   场地编号
	 * name         可选   场地名称
	 * type         可选   场地类型 代码13 1普通教室
	 * address      可选   场地地址
	 * seatNum      可选   座位数量
	 * merge        可选   并班系数
	 * state        可选   场地状态 2正常 3关闭 4历史
	 * remark       可选   备注
	 * schNm        可选   校区名称
	 * depNm        可选   部门名称
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[V_ClassRoom]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/rom!newRec.action
	 *
	 * 参数
	 * schId    可选   场地校区
	 * depId    可选   场地部门
	 * nO       可选   场地编号
	 * name     必需   场地名称
	 * type     可选   场地类型 1普通教室
	 * address  可选   场地地址
	 * seatNum  可选   座位数量
	 * merge    可选   并班系数
	 * remark   可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{ClassRoom}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/rom!edit.action
	 *
	 * 参数
	 * romId    必需   场地Id
	 * schId    可选   场地校区
	 * depId    可选   场地部门
	 * nO       可选   场地编号
	 * name     可选   场地名称
	 * type     可选   场地类型 1普通教室
	 * address  可选   场地地址
	 * seatNum  可选   座位数量
	 * merge    可选   并班系数
	 * remark   可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/rom!chState.action
	 *
	 * 参数
	 * romIds   必需   场地Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4”的记录
	 * 权限：
	 *
	 * URL：p/rom!del.action
	 *
	 * 参数
	 * romIds   必需   场地Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
