/** 部门成员 */

	/** 部门Id   */ private Integer depId   ;
	/** 会员Id   */ private Long    memId   ;
	/** 成员类型 */ private Byte    memType ; //1普通 2负责人
	/** 成员状态 */ private Byte    memState; //2正常
	/** 备注     */ private String  remark  ;
	/** 部门类型 */ private Byte    depTp   ; //代码12 1校区 2教学 3行政
	/** 部门名称 */ private String  depNm   ;
	/** 会员账号 */ private String  memAcc  ;
	/** 会员姓名 */ private String  memNm   ;
	/** 会员昵称 */ private String  memNick ;
	/** 会员性别 */ private String  memSex  ; //男/女

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/depMem!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * depId        可选   部门Id
	 * memId        可选   会员Id
	 * memType      可选   成员类型 1普通 2负责人
	 * memState     可选   成员状态 2正常
	 * remark       可选   备注
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[DepMem]}
	 *
	 */

	//==================================================================================================================
	// 详细查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：详细查询
	 * 权限：
	 *
	 * URL：p/depMem!query2.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * depId        可选   部门Id
	 * memId        可选   会员Id
	 * memType      可选   成员类型 1普通 2负责人
	 * memState     可选   成员状态 2正常
	 * remark       可选   备注
	 * depTp        可选   部门类型 代码12 1校区 2教学 3行政
	 * depNm        可选   部门名称
	 * memAcc       可选   会员账号
	 * memNm        可选   会员姓名
	 * memNick      可选   会员昵称
	 * memSex       可选   会员性别 男/女
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[V_DepMem]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/depMem!newRec.action
	 *
	 * 参数
	 * depId     必需   部门Id
	 * memId     必需   会员Id
	 * memType   可选   成员类型 1普通 2负责人
	 * memState  可选   成员状态 2正常
	 * remark    可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{DepMem}}
	 *
	 */

	//==================================================================================================================
	// 批量保存(新增更新)
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：批量保存(新增更新)
	 * 权限：
	 *
	 * URL：p/depMem!batSave.action
	 *
	 * 参数
	 * depId     必需   部门Id
	 * memIds    必需   会员Id 多个用“,”隔开
	 * memType   可选   成员类型 1普通 2负责人
	 * memState  可选   成员状态 2正常
	 * remark    可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{SchStu}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/depMem!edit.action
	 *
	 * 参数
	 * depId     必需   部门Id
	 * memId     必需   会员Id
	 * memType   可选   成员类型 1普通 2负责人
	 * memState  可选   成员状态 2正常
	 * remark    可选   备注
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除
	 * 权限：
	 *
	 * URL：p/depMem!del.action
	 *
	 * 参数
	 * depIds   必需   部门Id 多个用“,”隔开
	 * memIds   必需   会员Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
