/** 部门信息 */

	/** 部门Id   */ private Integer depId   ;
	/** 父部门Id */ private Integer fatherId;
	/** 部门类型 */ private Byte    type    ; //代码12 1校区 2教学 3行政
	/** 部门名称 */ private String  name    ;
	/** 部门简介 */ private String  biref   ;
	/** 相关学级 */ private Byte    lrnLv   ; //代码4 1小学 2初中 3高中
	/** 相关级段 */ private Byte    grade   ; //代码5 11小一 21初一 31高一
	/** 相关学科 */ private Short   subject ; //代码2 1语文 2数学
	/** 相关专业 */ private Integer major   ; //代码3
	/** 部门状态 */ private Byte    state   ; //2正常 3关闭 4历史

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：
	 *
	 * URL：p/dep!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * depId        可选   部门Id
	 * fatherId     可选   父部门Id
	 * type         可选   部门类型 代码12 1校区 2教学 3行政
	 * name         可选   部门名称
	 * biref        可选   部门简介
	 * lrnLv        可选   相关学级 代码4 1小学 2初中 3高中
	 * grade        可选   相关级段 代码5 11小一 21初一 31高一
	 * subject      可选   相关学科 代码2 1语文 2数学
	 * major        可选   相关专业 代码3
	 * state        可选   部门状态 2正常 3关闭 4历史
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 * doTp         可选   1=查询所有子部门(包含自身)、2=查询所有子部门(不含自身)，默认不查子部门 -- 指定depId查询时有效
	 *
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[Department]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/dep!newRec.action
	 *
	 * 参数
	 * fatherId  可选   父部门Id
	 * type      必需   部门类型
	 * name      必需   部门名称
	 * biref     可选   部门简介
	 * lrnLv     可选   相关学级
	 * grade     可选   相关级段
	 * subject   可选   相关学科
	 * major     可选   相关专业
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{Department}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/dep!edit.action
	 *
	 * 参数
	 * depId     必需   部门Id
	 * fatherId  可选   父部门Id
	 * type      可选   部门类型
	 * name      可选   部门名称
	 * biref     可选   部门简介
	 * lrnLv     可选   相关学级
	 * grade     可选   相关级段
	 * subject   可选   相关学科
	 * major     可选   相关专业
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/dep!chState.action
	 *
	 * 参数
	 * depIds   必需   部门Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4历史”的记录
	 * 权限：
	 *
	 * URL：p/dep!del.action
	 *
	 * 参数
	 * depIds   必需   部门Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
