/** 学识信息 */

	/** 学识Id   */ private Integer lrnId   ;
	/** 学识名称 */ private String  lrnName ;
	/** 学识学科 */ private Short   lrnSub  ; //1语文 2数学 ...
	/** 学识学级 */ private Byte    lrnLrv  ; //1小学 2初中 3高中 ...
	/** 学识级段 */ private Byte    lrnGra  ; //11小一 21初一 31高一 ...
	/** 学识专业 */ private Integer lrnMaj  ; //...
	/** 学识状态 */ private Byte    state   ; //2正常 3关闭 4历史
	/** 学识简价 */ private String  lrnBrief;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：无限制
	 *
	 * URL：p/learn!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * lrnId        可选   学识Id
	 * lrnName      可选   学识名称
	 * lrnSub       可选   学识学科 1语文 2数学 ...
	 * lrnLrv       可选   学识学级 1小学 2初中 3高中 ...
	 * lrnGra       可选   学识级段 11小一 21初一 31高一 ...
	 * lrnMaj       可选   学识专业 ...
	 * state        可选   学识状态 2正常 3关闭 4历史
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[Learn]}
	 *
	 */

	//==================================================================================================================
	// 获取学识简介
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：获取学识简介
	 * 权限：无限制
	 *
	 * URL：p/learn!getBrief.action
	 *
	 * 参数
	 * lrnId   必需   学识Id
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"简介内容"}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/learn!newRec.action
	 *
	 * 参数
	 * lrnName   必需   学识名称
	 * lrnSub    可选   学识学科 1语文 2数学 ...
	 * lrnLrv    可选   学识学级 1小学 2初中 3高中 ...
	 * lrnGra    可选   学识级段 11小一 21初一 31高一 ...
	 * lrnMaj    可选   学识专业 ...
	 * lrnBrief  可选   学识简介
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{Learn}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/learn!edit.action
	 *
	 * 参数
	 * lrnId     必需   学识Id
	 * lrnName   可选   学识名称
	 * lrnSub    可选   学识学科 1语文 2数学 ...
	 * lrnLrv    可选   学识学级 1小学 2初中 3高中 ...
	 * lrnGra    可选   学识级段 11小一 21初一 31高一 ...
	 * lrnMaj    可选   学识专业 ...
	 * lrnBrief  可选   学识简介
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/learn!chState.action
	 *
	 * 参数
	 * lrnIds   必需   学识Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4”的记录
	 * 权限：
	 *
	 * URL：p/learn!del.action
	 *
	 * 参数
	 * lrnIds   必需   学识Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
