/** 教材目录 */

	/** 教材章节Id */ private Integer tbkSecId;
	/** 章节教材   */ private Integer tbkId   ;
	/** 父结点Id   */ private Integer fatherId;
	/** 教材章节名 */ private String  tbkSecNm;
	/** 教材章节类 */ private Byte    tbkSecTp; //1章 2节 3点
	/** 章节顺序   */ private Double  order   ;
	/** 识识点Id   */ private Integer knoId   ;
	/** 章节状态   */ private Byte    state   ; //2正常 3关闭 4历史

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：无限制
	 *
	 * URL：p/tbkSec!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * tbkSecId     可选   教材章节Id
	 * tbkId        可选   章节教材
	 * fatherId     可选   父结点Id  0代表查根级(第1级)结点
	 * tbkSecNm     可选   教材章节名
	 * tbkSecTp     可选   教材章节类 1章 2节 3点
	 * order        可选   章节顺序
	 * knoId        可选   识识点Id
	 * state        可选   章节状态 2正常 3关闭 4历史
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 * doTp         可选   1=查询所有子结点(包含自身)、2=查询所有子结点(不含自身)，默认不查子结点 -- 指定tbkSecId查询时有效
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[TbkSection]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/tbkSec!newRec.action
	 *
	 * 参数
	 * tbkId     必需   教材Id
	 * fatherId  可选   父结点Id
	 * tbkSecNm  必需   教材章节名
	 * tbkSecTp  可选   教材章节类 1章 2节 3点
	 * order     可选   章节顺序
	 * knoId     可选   识识点Id
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{TbkSection}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/tbkSec!edit.action
	 *
	 * 参数
	 * tbkSecId  必需   教材章节Id
	 * tbkId     可选   教材Id
	 * fatherId  可选   父结点Id
	 * tbkSecNm  可选   教材章节名
	 * tbkSecTp  可选   教材章节类 1章 2节 3点
	 * order     可选   章节顺序
	 * knoId     可选   识识点Id
	 * state     可选   章节状态 2正常 3关闭 4历史
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/tbkSec!chState.action
	 *
	 * 参数
	 * tbkSecIds   必需   教材章节Id 多个用“,”隔开
	 * state       必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4”的记录
	 * 权限：
	 *
	 * URL：p/tbkSec!del.action
	 *
	 * 参数
	 * tbkSecIds   必需   教材章节Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
