/** 知识点 */

	/** 知识点Id   */ private Integer knoId   ;
	/** 学识Id     */ private Integer lrnId   ;
	/** 父结点Id   */ private Integer fatherId;
	/** 知识点名称 */ private String  knoName ;
	/** 知识点类型 */ private Byte    knoType ; //保留未定义
	/** 知识点顺序 */ private Double  order   ;
	/** 知识点状态 */ private Byte    state   ; //2正常 3关闭 4历史

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：查询
	 * 权限：无限制
	 *
	 * URL：p/know!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * knoId        可选   知识点Id
	 * lrnId        可选   学识Id
	 * fatherId     可选   父结点Id  0代表查根级(第1级)结点
	 * knoName      可选   知识点名称
	 * knoType      可选   知识点类型
	 * order        可选   知识点顺序
	 * state        可选   知识点状态 2正常 3关闭 4历史
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 * doTp         可选   1=查询所有子结点(包含自身)、2=查询所有子结点(不含自身)，默认不查子结点 -- 指定knoId查询时有效
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"t":"总记录数","d":[Knowledge]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：新增
	 * 权限：
	 *
	 * URL：p/know!newRec.action
	 *
	 * 参数
	 * lrnId     必需   学识Id
	 * fatherId  可选   父结点Id
	 * knoName   必需   知识点名称
	 * knoType   可选   知识点类型
	 * order     可选   知识点顺序
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息","d":{Knowledge}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改
	 * 权限：
	 *
	 * URL：p/know!edit.action
	 *
	 * 参数
	 * knoId     必需   知识点Id
	 * lrnId     可选   学识Id
	 * fatherId  可选   父结点Id
	 * knoName   可选   知识点名称
	 * knoType   可选   知识点类型
	 * order     可选   知识点顺序
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：修改记录状态
	 * 权限：
	 *
	 * URL：p/know!chState.action
	 *
	 * 参数
	 * knoIds   必需   知识点Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 * 功能：删除  只能删除状态为“4”的记录
	 * 权限：
	 *
	 * URL：p/know!del.action
	 *
	 * 参数
	 * knoIds   必需   知识点Id 多个用“,”隔开
	 *
	 * 出错返回：{"s":false,"m":"错误信息"}
	 * 正确返回：{"s":true,"m":"成功信息"}
	 *
	 */

	//==================================================================================================================
